common-services/src/test/resources/com/osa/parsers/mockSoapOriginStations.xml

<?xml version="1.0" encoding="UTF-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <stationList xmlns="http://spring.io/guides/gs-producing-web-service">
            <station>
                <id>3577284194159073280</id>
                <code>06642127</code>
                <name>cGjDBRL</name>
                <address>AJhEJuLGLPcqrxdBq8NGB7PbpH23lhWM</address>
                <coordinates>
                    <latitude>63.58710087009719</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>5520686919769670656</id>
                    <name>KnpnpgVOmcAOorxH</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>Bermuda</name>
                        <code>BM</code>
                    </country>
                </city>
                <country>
                    <name>St Pierre And Miquelon</name>
                    <code>PM</code>
                </country>
            </station>
            <station>
                <id>7048806087079653376</id>
                <code>40377286</code>
                <name>exHbYyFsTAxiqEgZqB</name>
                <address>ZEOY149jw9c92REALVah88VIiN</address>
                <coordinates>
                    <latitude>62.52870384661577</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>4613160863739529216</id>
                    <name>RXTalyupXjGhMAAndD</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>Ukraine</name>
                        <code>UA</code>
                    </country>
                </city>
                <country>
                    <name>Sint Maarten</name>
                    <code>SX</code>
                </country>
            </station>
            <station>
                <id>6006205986402219008</id>
                <code>82471841</code>
                <name>TAwdFkbGxdhVdpOPh</name>
                <address>UydABURQcrny87ZnsDZRnOKx6b1hM8</address>
                <coordinates>
                    <latitude>59.81375776304216</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>4000285372888003584</id>
                    <name>Fefmmz</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>Germany</name>
                        <code>DE</code>
                    </country>
                </city>
                <country>
                    <name>Spain</name>
                    <code>ES</code>
                </country>
            </station>
            <station>
                <id>3247450743729300480</id>
                <code>39132606</code>
                <name>cwDNTZLrIoHMUvVMAUz</name>
                <address>fGB3yiOpnfDuo5rWp5KBV5f</address>
                <coordinates>
                    <latitude>57.61587700939037</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>5758306247997919232</id>
                    <name>ygHPyilGxpWGkoKZID</name>
                    <cityClass>B</cityClass>
                    <country>
                        <name>Myanmar</name>
                        <code>MM</code>
                    </country>
                </city>
                <country>
                    <name>Tanzania</name>
                    <code>TZ</code>
                </country>
            </station>
            <station>
                <id>6076874926936469504</id>
                <code>90998999</code>
                <name>IKTXjjr</name>
                <address>nd10gxMrXW4tMN5VQX</address>
                <coordinates>
                    <latitude>43.48606970036311</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>2601468979490920448</id>
                    <name>OZfCz</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>British Indian Ocean Territory</name>
                        <code>IO</code>
                    </country>
                </city>
                <country>
                    <name>St Vincent And Grenadines</name>
                    <code>VC</code>
                </country>
            </station>
            <station>
                <id>7265887706807702528</id>
                <code>43298796</code>
                <name>ZjWCanlv</name>
                <address>8z6rMiQtgrlmcpEBLe33ct</address>
                <coordinates>
                    <latitude>60.90258469377913</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>2584015505506984960</id>
                    <name>CkLryRpsKsmoJU</name>
                    <cityClass>B</cityClass>
                    <country>
                        <name>Suriname</name>
                        <code>SR</code>
                    </country>
                </city>
                <country>
                    <name>Antarctica</name>
                    <code>AQ</code>
                </country>
            </station>
            <station>
                <id>4389482904226183168</id>
                <code>68234630</code>
                <name>VuJmoYUUVeyDjn</name>
                <address>WhBSA5Pj9u2LmHClnWji0CPHFUfytJzR</address>
                <coordinates>
                    <latitude>63.76317563210987</latitude>
                    <longitude>1.0809625631293107E308</longitude>
                </coordinates>
                <city>
                    <id>4139907369975324672</id>
                    <name>yCoCk</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>Latvia</name>
                        <code>LV</code>
                    </country>
                </city>
                <country>
                    <name>Ascension Islands</name>
                    <code>AC</code>
                </country>
            </station>
            <station>
                <id>3257182085858428928</id>
                <code>68199534</code>
                <name>GnzkgehhCWTUIN</name>
                <address>saM8l5B9tcSK1nkWYHHYauAZe52sf</address>
                <coordinates>
                    <latitude>57.73825868289709</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>1805320417275757568</id>
                    <name>wmDQj</name>
                    <cityClass>B</cityClass>
                    <country>
                        <name>Bahrain</name>
                        <code>BH</code>
                    </country>
                </city>
                <country>
                    <name>New Zealand</name>
                    <code>NZ</code>
                </country>
            </station>
            <station>
                <id>2661378908664672256</id>
                <code>51977078</code>
                <name>lFHtyCoL</name>
                <address>Pv3k8GHo6huKDSklja</address>
                <coordinates>
                    <latitude>37.45654909963828</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>8499664405896083456</id>
                    <name>keXhOuJGpq</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>Angola</name>
                        <code>AO</code>
                    </country>
                </city>
                <country>
                    <name>Iceland</name>
                    <code>IS</code>
                </country>
            </station>
            <station>
                <id>3618695131974742016</id>
                <code>00162330</code>
                <name>NvhJyBGUIAyfj</name>
                <address>E2FCR5r1tlsy2WqvvM</address>
                <coordinates>
                    <latitude>47.728384705144485</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>1358735658947512320</id>
                    <name>ywqQpagwfMYEAAP</name>
                    <cityClass>B</cityClass>
                    <country>
                        <name>Guadeloupe</name>
                        <code>GP</code>
                    </country>
                </city>
                <country>
                    <name>Solomon Islands</name>
                    <code>SB</code>
                </country>
            </station>
        </stationList>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>